{"C": 0, "N": 1, "S": 2, "O": 3, "Cl": 4, "B": 5, "I": 6, "F": 7, "Si": 8, "Br": 9, "P": 10, "Sc": 11, "Mg": 12, "H": 13, "W": 14, "Cr": 15, "As": 16, "Na": 17, "Sn": 18, "Ru": 19, "Ge": 20, "Zn": 21, "Pt": 22, "Co": 23, "Cu": 24, "Nd": 25, "Li": 26, "Ag": 27, "Se": 28, "Hg": 29, "V": 30, "Fe": 31, "Pd": 32, "Al": 33, "Ir": 34, "Pb": 35, "Te": 36, "Mn": 37, "Ni": 38, "Tc": 39, "Cd": 40, "Ti": 41, "K": 42, "Ca": 43, "Au": 44, "Rh": 45, "Hf": 46, "Nb": 47, "Mo": 48, "Zr": 49, "Gd": 50, "Rb": 51, "Yb": 52, "Sm": 53, "Sb": 54, "Eu": 55, "Ga": 56, "Re": 57, "Cs": 58, "Tl": 59, "Lu": 60, "Ce": 61, "Bi": 62, "La": 63, "Os": 64, "Th": 65, "Sr": 66, "Pu": 67, "Tm": 68, "Ba": 69, "Am": 70, "Be": 71, "Y": 72, "In": 73, "Tb": 74, "Cf": 75, "U": 76, "Ta": 77, "NO2": 78, "O2N": 79, "CHO": 80, "OHC": 81, "CO2Et": 82, "COOEt": 83, "OAc": 84, "NHAc": 85, "Ac": 86, "OBz": 87, "Bz": 88, "OBn": 89, "Bn": 90, "NHBoc": 91, "NBoc": 92, "Boc": 93, "Cbm": 94, "Cbz": 95, "Cy": 96, "Fmoc": 97, "Mes": 98, "OMs": 99, "Ms": 100, "Ph": 101, "Py": 102, "Suc": 103, "TBS": 104, "TBZ": 105, "OTf": 106, "Tf": 107, "TFA": 108, "TMS": 109, "Ts": 110, "OMe": 111, "MeO": 112, "SMe": 113, "MeS": 114, "NMe": 115, "MeN": 116, "Me": 117, "OEt": 118, "EtO": 119, "Et": 120, "Pr": 121, "nPr": 122, "Bu": 123, "nBu": 124, "iPr": 125, "iBu": 126, "OiBu": 127, "OtBu": 128, "tBu": 129, "CF3": 130, "F3C": 131, "NCF3": 132, "CCl3": 133, "CO2H": 134, "COOH": 135, "CN": 136, "OCH3": 137, "SO3H": 138, "Ar": 139, "None": 140, "Decoy": 141, "N,1": 142, "N,-1": 143, "O,-1": 144, "O,1": 145, "S,-1": 146, "C,-1":147, "P,1": 148, "I,-1": 149, "Br,2": 150, "S,1": 151, "C,1": 152, "B,-1": 153, "I,1": 154, "Si,-1": 155, "Al,1": 156, "Zr,2": 157, "Cl,2": 158, "Si,1": 159, "Se,-1": 160, "Cl,1": 161, "Sn,1": 162, "Tc,3": 163, "P,-1": 164, "As,1": 165, "Si,2": 166, "Cl,3": 167, "Se,1": 168, "Sn,-1": 169, "Sn,2": 170, "Sn,3": 171, "P,-2": 172, "Br,3": 173, "I,2": 174, "Te,1": 175, "Mg,1": 176, "Bi,-1": 177, "Sb,-1": 178, "Sb,1": 179, "Bi,2": 180, "R": 181}